; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=18, remove_proportion=0.2, bases=3, instance_id=7, output=./training, seed=48

(define (problem warehouse-07)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 - box
        base1 base2 base3 - base
    )
    (:init
        (to-remove box5)
        (to-remove box11)
        (to-remove box18)
        (clear box16)
        (on box16 box10)
        (on box10 box6)
        (on box6 box12)
        (on box12 box9)
        (on box9 box15)
        (on-base box15 base1)
        (clear box13)
        (on box13 box8)
        (on box8 box4)
        (on-base box4 base2)
        (clear box17)
        (on box17 box14)
        (on box14 box1)
        (on box1 box7)
        (on box7 box18)
        (on box18 box11)
        (on box11 box5)
        (on box5 box3)
        (on box3 box2)
        (on-base box2 base3)
    )
    (:goal (and 
        (removed box5)
        (removed box11)
        (removed box18)
    ))
)

; plan
1. (move box17 box14 box13)
   deleted: (clear box13) (on box17 box14)
   added: (on box17 box13) (clear box14)
   goals met: 0 of 3
2. (move box14 box1 box16)
   deleted: (clear box16) (on box14 box1)
   added: (on box14 box16) (clear box1)
   goals met: 0 of 3
3. (move box1 box7 box14)
   deleted: (clear box14) (on box1 box7)
   added: (on box1 box14) (clear box7)
   goals met: 0 of 3
4. (move box7 box18 box1)
   deleted: (clear box1) (on box7 box18)
   added: (on box7 box1) (clear box18)
   goals met: 0 of 3
5. (remove box18 box11)
   deleted: (on box18 box11) (clear box18)
   added: (removed box18) (clear box11)
   goals met: 1 of 3
6. (remove box11 box5)
   deleted: (on box11 box5) (clear box11)
   added: (removed box11) (clear box5)
   goals met: 2 of 3
7. (remove box5 box3)
   deleted: (on box5 box3) (clear box5)
   added: (removed box5) (clear box3)
   goals met: 3 of 3
